/* Alert text for Retro Synth audio file analysis in case another analysis is still ongoing */
"A wavetable is currently being created. Please try again after the creation process has finished." = "Aaltomuototaulukkoa luodaan. Yritä uudelleen, kun luontiprosessi on päättynyt.";

/* Alert text for Retro Synth audio file analysis result info */
"Timbral information for a single waveform was detected. Formant modulation is available, by switching the Modulation knob to “Formant”. The Shape 1 and Shape 2 knobs are not functional." = "Yhden aaltomuodon sointiväri havaittiin. Formanttimodulaatio on käytettävissä asettamalla modulaatiosäädin asentoon Formantti. Muoto 1 ja Muoto 2 -säätimet eivät ole toiminnassa.";

/* Alert text for Retro Synth audio file analysis result info on failure */
"To create a wavetable, the audio file must have a constant pitch, several pitched sections separated by silence, or one or more single cycle sections." = "Aaltomuototaulukon luomiseksi äänitiedostossa on oltava tasainen äänenkorkeus, useita äänellisiä alueita, jotka on erotettu hiljaisuudella, ja yksi tai useampia syklijaksoja.";

/* Alert text for Retro Synth audio file analysis result info on success */
"The new wavetable contains %d waveforms." = "Uudessa aaltomuototaulukossa on %d aaltomuotoa.";

/* Alert title for Retro Synth audio file analysis in case another analysis is still ongoing */
"Wavetable Being Created" = "Aaltomuototaulukkoa luodaan";

/* Alert title for Retro Synth audio file analysis result info */
"Wavetable Created With a Single Waveform" = "Aaltomuototaulukko luotiin yhdestä aaltomuodosta";

/* Alert title for Retro Synth audio file analysis result info on failure */
"Wavetable Not Created" = "Aaltomuototaulukkoa ei luotu";

/* Alert title for Retro Synth audio file analysis result info on success */
"Wavetable Created" = "Aaltomuototaulukko luotu";

/* Compressor side chain default menu item name */
"CompressorSideChainDefaultItemName" = "Sisäinen";

/* Compressor side chain menu name */
"CompressorSideChainMenuName" = "Sivuketju:";

/* ES1 synth side chain default menu item name */
"ES1SideChainDefaultItemName" = "Pois";

/* ES1 synth side chain menu name */
"ES1SideChainMenuName" = "Ulkoinen äänitulo:";

/* Flex analysis progress indicator detail info */
"Identification of Notes" = "Nuottien tunnistaminen";

/* Flex analysis progress indicator detail info */
"Pitch Analysis" = "Korkeusanalyysi";

/* Flex analysis progress indicator info */
"Analyzing: %@" = "Analysoidaan: %@";

/* Playback file alert */
"PlaybackFileNotFoundHeader" = "Tiedoston avausvirhe";

/* Playback file alert */
"PlaybackFileNotFoundMessage" = "Tiedostoa, jonka yrität ladata, ei löydy.";

/* Playback file alert */
"PlaybackFileOpenErrorHeader" = "Tiedoston avausvirhe";

/* Playback file alert */
"PlaybackFileOpenErrorMessage" = "Valitun tiedoston lataamiseen ei ole tarpeeksi vapaata muistia.";

/* Playback file alert */
"PlaybackTempoMarkerErrorHeader" = "Tiedosto sisältää tempon muutoksia";

/* Playback file alert */
"PlaybackTempoMarkerErrorMessage" = "Varoitus: Yksi tai useampi tuotavista tiedostoista sisältää temponmuutosmerkkejä. Tämä MainStage-versio ei tue tempomuutoksia sisältävien tiedostojen synkronointia.";

/* Playback file alert */
"PlaybackTransientsErrorHeader" = "Tiedoston avausvirhe";

/* Playback file alert */
"PlaybackTransientsMessage" = "Valitussa tiedostossa olevat kohdistusmerkit on kätketty Logic Prossa. Avaa tiedosto Logic Prossa ja poista kohdistusmerkkien kätkentä ennen tiedoston avaamista liitännäisessä.";

/* Playback file alert */
"PlaybackUnknownErrorHeader" = "Tuntematon virhe";

/* Playback file alert */
"PlaybackUnknownErrorMessage" = "Valittua tiedostoa ei voitu avata.";

/* Playback file alert */
"PlaybackUnsupportedFileHeader" = "Äänitiedostomuotoa ei tueta";

/* Playback file alert */
"PlaybackUnsupportedFileMessage" = "Äänitiedosto, jota yrität lisätä, ei ole tuetussa tiedostomuodossa. Muunna tiedosto tuettuun muotoon iTunesilla tai muulla ääniohjelmalla ennen sen lisäämistä toistoliitännäiseen.";

/* suffix for file names not being loaded into SpaceDesigner */
"MissingFileSuffix" = " (tiedosto puuttuu)";
